W/W2024-05-fopc1234.org
#+title: Five varieties of first-order predicate calculus
#+author: CMSMcQ and CH
#+date: 16 May 2024

This document describes several languages for the expression of
logical formulas, each containing the preceding.  For convenient
reference, the languages are given names chosen to suggest their
relative sizes:

- *XS* (extra-small), the first language, is for sentential logic.
- *S* (small) is for first-order logic without identity.
- *M* (medium) is for first-order logic with functions and identity.
  We believe but have not undertaken to prove that M is equivalent to
  the TPTP language of first-order formulas, FOF.
- *L* (large) adds some convenience features: typed quantification,
  unique existential quantification, and skolem functions.  It is at
  least roughly comparable to the TFF (typed first-order formulas)
  language of TPTP.
- *XL* (extra-large) adds sets and set operations.  /Open question:
  add tuples?/

# The grammars given here are adapted from a grammar developed by the
# authors in 2021 and 2022.

* Design goals and design decisions

One goal of the paper is to provide a more precise description of the
target language(s) for our work translating Alloy models into
first-order logic.

A secondary goal is to provide a convenient syntax for presentation
and discussion of formulas that is as far as possible agnostic on the
particular symbols used for quantification and logical operators.
Textbooks on logic are notoriously divergent in their choices of
symbols, and so are those who publish papers containing logical
formulas.  Software for dealing with formulas is equally various in
its choices.  We see no reason to insist that logical conjunction be
expressed with "&" but not with "/\" or "∧" or even just "and", and so
on.

Because different people seem to have different intuitions about which
logical operators should bind more tightly and which less tightly, we
do not attempt an elaborate set of operator priorities.  We allow (A
and (B and C)) to be writte (A and B and C), and similarly for (A or
(B or C)), but otherwise all nested compound expressions must be
parenthesized.  (This is a change from the grammar we worked on in
2021 and 2022.)

To avoid possible confusion over the scope of quantifiers, the same
rule applies to quantifications: we can write ∃x P(x), or (∃x)P(x),
but if the quantifier's scope includes an operator, parentheses are
needed:  ∃x (P(x) ∧ Q(x)).

We assume that for applications of logic to a domain (what Quine calls
post-foundational systems), it is important for identifiers to be
mnemonic, and (thus) that identifiers will often be longer than one
character.  

* Language XS:  sentential logic

Language XS is for sentential logic.

** Basics: Names, whitespace, comments

The basic symbols of the language are Unicode characters.

*** Names

A name is a sequence of characters beginning with a letter and containing
only letters, numeric digits, hyphens, and underscores.
#+name: Names 
#+begin_src ixml :noweb-ref Names
name = letter, namechar*.
-letter = [L].
-namechar = letter; digit; ["-_"].
-digit = [Nd].
#+end_src

Example names:
#+begin_example
p
q
Prop-2a
φ
#+end_example

*** Whitespace

Whitespace is any member of Unicode class Zs (Separator, space), as
well as a few control characters.  Required space is one or more
whitespace characters or comments; optional space is zero or more.
#+name: Whitespace
#+begin_src ixml :noweb-ref Whitespace
-whitespace = -[Zs; #9; #A; #D].
-RS = (whitespace; comment)+.
-os = (whitespace; comment)*.
{ NL for required line breaks }
-NL = (-[Zs; #9] | comment)*, #A, os.
#+end_src

