W/W2024-05-fopc1234.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-05-23 Thu 16:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Five varieties of first-order predicate calculus</title>
<meta name="author" content="CMSMcQ and CH" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Five varieties of first-order predicate calculus</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0e2da60">1. Design goals and design decisions</a></li>
<li><a href="#org3db4f01">2. Language XS:  sentential logic</a>
<ul>
<li><a href="#orgc29d2bd">2.1. Basics: Names, whitespace, comments</a>
<ul>
<li><a href="#org770fc19">2.1.1. Names</a></li>
<li><a href="#orgbf30170">2.1.2. Whitespace</a></li>
<li><a href="#org274d070">2.1.3. Comments</a></li>
<li><a href="#org6bd2622">2.1.4. Recapitulation (comments)</a></li>
</ul>
</li>
<li><a href="#org5db8eaa">2.2. Propositional variables and constants</a></li>
<li><a href="#org407e593">2.3. Formulas</a></li>
<li><a href="#orgf69aa36">2.4. Logical Operators</a></li>
<li><a href="#org215b4cd">2.5. Recapitulation</a></li>
<li><a href="#orgb589eec">2.6. Tests</a></li>
</ul>
</li>
<li><a href="#orgd98042b">3. Language S:  first-order logic</a>
<ul>
<li><a href="#orgb687815">3.1. Note on different uses of identifiers</a></li>
<li><a href="#orgcedf164">3.2. Variables and constants</a></li>
<li><a href="#orgcb42580">3.3. Predicates</a></li>
<li><a href="#orgd02453d">3.4. Quantification</a></li>
<li><a href="#orgee67e78">3.5. Formulas</a></li>
<li><a href="#org756d594">3.6. Recapitulation of language S</a></li>
<li><a href="#orgf63b67b">3.7. Tests for language S</a></li>
</ul>
</li>
<li><a href="#org8d45f17">4. Language M:  first-order logic with identity and functions</a></li>
<li><a href="#orgf2e4ec6">5. Language L:  additional convenience features</a></li>
<li><a href="#org4d7edb8">6. Language XL: first-order logic plus set theory</a></li>
<li><a href="#org58d9e89">7. Concluding notes</a>
<ul>
<li><a href="#org62112d1">7.1. To do</a></li>
<li><a href="#orga50b318">7.2. Questions to consider</a></li>
<li><a href="#orgbd05d0c">7.3. Done</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
This document describes several languages for the expression of
logical formulas, each containing the preceding.  For convenient
reference, the languages are given names chosen to suggest their
relative sizes:
</p>

<ul class="org-ul">
<li><b>XS</b> (extra-small), the first language, is for sentential logic.</li>
<li><b>S</b> (small) is for first-order logic without identity.</li>
<li><b>M</b> (medium) is for first-order logic with functions and identity.
We believe but have not undertaken to prove that M is equivalent to
the TPTP language of first-order formulas, FOF.</li>
<li><b>L</b> (large) adds some convenience features: typed quantification,
unique existential quantification, and skolem functions.  It is at
least roughly comparable to the TFF (typed first-order formulas)
language of TPTP.</li>
<li><b>XL</b> (extra-large) adds sets and set operations.  <i>Open question:
add tuples?</i></li>
</ul>

<div id="outline-container-org0e2da60" class="outline-2">
<h2 id="org0e2da60"><span class="section-number-2">1.</span> Design goals and design decisions</h2>
<div class="outline-text-2" id="text-1">
<p>
One goal of the paper is to provide a more precise description of the
target language(s) for our work translating Alloy models into
first-order logic.
</p>

<p>
A secondary goal is to provide a convenient syntax for presentation
and discussion of formulas that is as far as possible agnostic on the
particular symbols used for quantification and logical operators.
Textbooks on logic are notoriously divergent in their choices of
symbols, and so are those who publish papers containing logical
formulas.  Software for dealing with formulas is equally various in
its choices.  We see no reason to insist that logical conjunction be
expressed with "&amp;" but not with "/\" or "∧" or even just "and", and so
on.
</p>

<p>
Because different people seem to have different intuitions about which
logical operators should bind more tightly and which less tightly, we
do not attempt an elaborate set of operator priorities.  We allow (A
and (B and C)) to be writte (A and B and C), and similarly for (A or
(B or C)), but otherwise all nested compound expressions must be
parenthesized.  (This is a change from the grammar we worked on in
2021 and 2022.)
</p>

<p>
To avoid possible confusion over the scope of quantifiers, the same
rule applies to quantifications: we can write ∃x P(x), or (∃x)P(x),
but if the quantifier's scope includes an operator, parentheses are
needed:  ∃x (P(x) ∧ Q(x)).
</p>

<p>
We assume that for applications of logic to a domain (what Quine calls
post-foundational systems), it is important for identifiers to be
mnemonic, and (thus) that identifiers will often be longer than one
character.  
</p>
</div>
</div>

<div id="outline-container-org3db4f01" class="outline-2">
<h2 id="org3db4f01"><span class="section-number-2">2.</span> Language XS:  sentential logic</h2>
<div class="outline-text-2" id="text-2">
<p>
Language XS is for sentential logic.
</p>
</div>

<div id="outline-container-orgc29d2bd" class="outline-3">
<h3 id="orgc29d2bd"><span class="section-number-3">2.1.</span> Basics: Names, whitespace, comments</h3>
<div class="outline-text-3" id="text-2-1">
<p>
The basic symbols of the language are Unicode characters.
</p>
</div>

<div id="outline-container-org770fc19" class="outline-4">
<h4 id="org770fc19"><span class="section-number-4">2.1.1.</span> Names</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
A name is a sequence of characters beginning with a letter and containing
only letters, numeric digits, hyphens, and underscores.
</p>
<div class="org-src-container">
<pre class="src src-ixml" id="org9425f8c">name = letter, namechar*.
-letter = [L].
-namechar = letter; digit; ["-_"].
-digit = [Nd].
</pre>
</div>

<p>
Example names:
</p>
<pre class="example" id="orgd2e9a38">
p
q
Prop-2a
φ
</pre>
</div>
</div>

<div id="outline-container-orgbf30170" class="outline-4">
<h4 id="orgbf30170"><span class="section-number-4">2.1.2.</span> Whitespace</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
Whitespace is any member of Unicode class Zs (Separator, space), as
well as a few control characters.  Required space is one or more
whitespace characters or comments; optional space is zero or more.
</p>
<div class="org-src-container">
<pre class="src src-ixml" id="org2d6a750">-whitespace = -[Zs; #9; #A; #D].
-RS = (whitespace; comment)+.
-os = (whitespace; comment)*.
{ NL for required line breaks }
-NL = (-[Zs; #9] | comment)*, #A, os.
</pre>
</div>
</div>
</div>
