W/W2024-05-fopc1234.org
*** Comments
A comment is a string of characters beginning with "\zwnj/\zwnj*"
(slash + asterisk) and ending with "\zwnj*\zwnj/" (asterisk + slash).
Comments may contain other comments, but not unmatched occurrences of
those delimiter strings.  Experience shows that this can easily be
formulated wrong, so we will start with a step-by-step development.
Within the comment, we can be in any of several states:
- *default*: the default state: nothing special has happened -- in
  particular, we have not seen a star or a slash.  In this state,
  several things can happen:
  + The empty string is acceptable (i.e. this can be the last state
    of the comment data.)
  + A character other than slash or asterisk returns us to this state.
  + A nested comment returns us to this state.
  + A slash that does not start a nested comment takes us to state
    *slash-seen*.
  + An asterisk not followed by a slash takes us to state *star-seen*.  
- *star-seen*:  we have seen an asterisk, and must not see a slash
  next.  (If a slash is next, this is the wrong state.)
  + The empty string is acceptable (i.e. this can be the last state
    of the comment data).
  + An asterisk that is not part of the comment-closing delimiter
    returns us to this state.
  + Any character other than a slash or an asteriak returns us to
    the *default* state.
- *slash-seen*:  we have seen a slash, and must not now see an asterisk.
  (If an asterisk is next, this is the wrong state.)
  + The empty string is not acceptable; this must /not/ be the last
    state of the comment data (since the closing delimiter starts
    with the asterisk, which we must not see).
  + A nested comment returns us to the *default* state.
  + A slash that does not start a comment returns us to this state.
  + Any character other than a slash or star returns us to the
    *default* state.

We can describe this with a pseudo-regular grammar for /comment-data/.
(Why "pseudo-regular"?  like a regular grammar, it has rules whose
right-hand sides have a single symbol followed by a non-terminal
naming the next state, but it is not truly regular because /comment/
is not a terminal symbol; it's just treated as if it were one.)

#+begin_src ixml :tangle no
      comment = "/*", comment-data, "*/".
 comment-data = default-state.
default-state = ()
              | ~["/*"], default-state
              | comment, default-state
              | "/", slash-seen
              | "*", star-seen
              .
    star-seen = ()
              | "*", star-seen
              | ~["/*"], default-state
              .
   slash-seen = comment, default-state
              | "/", slash-seen
              | ~["/*"], default-state
              .
#+end_src

The rules for /star-seen/ and /slash-seen/ can be simplified by
applying Arden's Lemma. (/A = X, A; B./ can be rewritten /A = X*, B./)
#+begin_src ixml :tangle no
default-state = ()
              | ~["/*"], default-state
              | comment, default-state
              | "/", slash-seen
              | "*", star-seen
              .          
   star-seen = "*"*, (~["/*"], default-state)?.
  slash-seen = "/"*, (comment | ~["/*"]), default-state.
#+end_src

Now the references to /star-seen/ and /slash-seen/ can be expanded
in place.  We then replace the right-hand side beginning with "*" 
with two simpler right-hand sides.
#+begin_src ixml :tangle no
default-state = ()
              | ~["/*"], default-state
              | comment, default-state
              | "/", "/"*, (comment | ~["/*"]), default-state
              | "*", "*"*, ~["/*"], default-state
              | "*", "*"*
              .          
#+end_src

Further simplification produces:
#+begin_src ixml :tangle no
default-state = "/"*, (comment | ~["/*"]), default-state
              | "*"+, ~["/*"], default-state
              | "*"*
              .          
#+end_src

We can now apply Arden's Lemma to /default-state/ to
produce a single rule for comment data.
#+begin_src ixml :tangle no
default-state = ("*"+, ~["/*"] | "/"*, (comment | ~["/*"]))*, "*"*.          
#+end_src

With that development providing some confidence in the
rule, we can write the comment rules for real now:
#+name: Comments
#+begin_src ixml :noweb-ref Comments
      comment = -"/*", comment-data, -"*/".
-comment-data = ("*"+, ~["/*"] 
                | "/"*, (comment | ~["/*"]))*, 
                "*"*.
#+end_src

This is complicated enough that it may be worth writing down
some positive and negative test cases.  Positive examples include:
#+begin_src data :tangle ../tests/comments-pos-01.txt
/**/
/* */
/* this is a comment */
/* *this* example/test case contains nested stars and a slash (/) */
/*/* a nested comment*/ and more*/
/*/* a nested comment*/*** and ////* another */*/
/*******/
/*//////* test */  ***/
#+end_src

Negative examples:
(1) An asterisk followed by a slash.
#+begin_src data :tangle ../tests/comments-neg-01.txt
/* A slash (*/*) cannot be emphasized here. */
#+end_src
(2) Comment data ending with a slash.
#+begin_src data :tangle ../tests/comments-neg-02.txt
/*///*/
#+end_src

An ad-hoc test grammar will allow us to run these test cases:
#+begin_src ixml :tangle ../tests/comment-tests.ixml :noweb tangle
tests = (whitespace; comment)*.
<<Comments>>
<<Whitespace>>
#+end_src

These tests can be run manually in a shell:
#+begin_example
for f in comments-*.txt ; \
    do markup-blitz.sh $f comment-tests.ixml ${f%.txt}.xml; \
    done
#+end_example
I have no automatic checking of results:  the positive
examples should produce XML results which look plausible,
and the negative examples should all fail to parse.  A quick
check can be done with
#+begin_example
grep ixml:state comments-*.xml
#+end_example

*** Recapitulation (comments)
We can sum up these low-level rules thus:
#+name: Basics
#+begin_src ixml :noweb-ref Basics :noweb yes

{ Basics:  names, whitespace, comments }
<<Names>>
<<Whitespace>>
<<Comments>>
#+end_src

