W/W2024-05-fopc1234.html

<div id="outline-container-org274d070" class="outline-4">
<h4 id="org274d070"><span class="section-number-4">2.1.3.</span> Comments</h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
A comment is a string of characters beginning with "&zwnj;/&zwnj;*"
(slash + asterisk) and ending with "&zwnj;*&zwnj;/" (asterisk + slash).
Comments may contain other comments, but not unmatched occurrences of
those delimiter strings.  Experience shows that this can easily be
formulated wrong, so we will start with a step-by-step development.
Within the comment, we can be in any of several states:
</p>
<ul class="org-ul">
<li><b>default</b>: the default state: nothing special has happened &#x2013; in
particular, we have not seen a star or a slash.  In this state,
several things can happen:
<ul class="org-ul">
<li>The empty string is acceptable (i.e. this can be the last state
of the comment data.)</li>
<li>A character other than slash or asterisk returns us to this state.</li>
<li>A nested comment returns us to this state.</li>
<li>A slash that does not start a nested comment takes us to state
<b>slash-seen</b>.</li>
<li>An asterisk not followed by a slash takes us to state <b>star-seen</b>.</li>
</ul></li>
<li><b>star-seen</b>:  we have seen an asterisk, and must not see a slash
next.  (If a slash is next, this is the wrong state.)
<ul class="org-ul">
<li>The empty string is acceptable (i.e. this can be the last state
of the comment data).</li>
<li>An asterisk that is not part of the comment-closing delimiter
returns us to this state.</li>
<li>Any character other than a slash or an asteriak returns us to
the <b>default</b> state.</li>
</ul></li>
<li><b>slash-seen</b>:  we have seen a slash, and must not now see an asterisk.
(If an asterisk is next, this is the wrong state.)
<ul class="org-ul">
<li>The empty string is not acceptable; this must <i>not</i> be the last
state of the comment data (since the closing delimiter starts
with the asterisk, which we must not see).</li>
<li>A nested comment returns us to the <b>default</b> state.</li>
<li>A slash that does not start a comment returns us to this state.</li>
<li>Any character other than a slash or star returns us to the
<b>default</b> state.</li>
</ul></li>
</ul>

<p>
We can describe this with a pseudo-regular grammar for <i>comment-data</i>.
(Why "pseudo-regular"?  like a regular grammar, it has rules whose
right-hand sides have a single symbol followed by a non-terminal
naming the next state, but it is not truly regular because <i>comment</i>
is not a terminal symbol; it's just treated as if it were one.)
</p>

<div class="org-src-container">
<pre class="src src-ixml">      comment = "/*", comment-data, "*/".
 comment-data = default-state.
default-state = ()
              | ~["/*"], default-state
              | comment, default-state
              | "/", slash-seen
              | "*", star-seen
              .
    star-seen = ()
              | "*", star-seen
              | ~["/*"], default-state
              .
   slash-seen = comment, default-state
              | "/", slash-seen
              | ~["/*"], default-state
              .
</pre>
</div>

<p>
The rules for <i>star-seen</i> and <i>slash-seen</i> can be simplified by
applying Arden's Lemma. (<i>A = X, A; B.</i> can be rewritten <i>A = X*, B.</i>)
</p>
<div class="org-src-container">
<pre class="src src-ixml">default-state = ()
              | ~["/*"], default-state
              | comment, default-state
              | "/", slash-seen
              | "*", star-seen
              .          
   star-seen = "*"*, (~["/*"], default-state)?.
  slash-seen = "/"*, (comment | ~["/*"]), default-state.
</pre>
</div>

<p>
Now the references to <i>star-seen</i> and <i>slash-seen</i> can be expanded
in place.  We then replace the right-hand side beginning with "*" 
with two simpler right-hand sides.
</p>
<div class="org-src-container">
<pre class="src src-ixml">default-state = ()
              | ~["/*"], default-state
              | comment, default-state
              | "/", "/"*, (comment | ~["/*"]), default-state
              | "*", "*"*, ~["/*"], default-state
              | "*", "*"*
              .          
</pre>
</div>

<p>
Further simplification produces:
</p>
<div class="org-src-container">
<pre class="src src-ixml">default-state = "/"*, (comment | ~["/*"]), default-state
              | "*"+, ~["/*"], default-state
              | "*"*
              .          
</pre>
</div>

<p>
We can now apply Arden's Lemma to <i>default-state</i> to
produce a single rule for comment data.
</p>
<div class="org-src-container">
<pre class="src src-ixml">default-state = ("*"+, ~["/*"] | "/"*, (comment | ~["/*"]))*, "*"*.          
</pre>
</div>

<p>
With that development providing some confidence in the
rule, we can write the comment rules for real now:
</p>
<div class="org-src-container">
<pre class="src src-ixml" id="org20c9ae3">      comment = -"/*", comment-data, -"*/".
-comment-data = ("*"+, ~["/*"] 
                | "/"*, (comment | ~["/*"]))*, 
                "*"*.
</pre>
</div>

<p>
This is complicated enough that it may be worth writing down
some positive and negative test cases.  Positive examples include:
</p>
<div class="org-src-container">
<pre class="src src-data">/**/
/* */
/* this is a comment */
/* *this* example/test case contains nested stars and a slash (/) */
/*/* a nested comment*/ and more*/
/*/* a nested comment*/*** and ////* another */*/
/*******/
/*//////* test */  ***/
</pre>
</div>

<p>
Negative examples:
(1) An asterisk followed by a slash.
</p>
<div class="org-src-container">
<pre class="src src-data">/* A slash (*/*) cannot be emphasized here. */
</pre>
</div>
<p>
(2) Comment data ending with a slash.
</p>
<div class="org-src-container">
<pre class="src src-data">/*///*/
</pre>
</div>

<p>
An ad-hoc test grammar will allow us to run these test cases:
</p>
<div class="org-src-container">
<pre class="src src-ixml">tests = (whitespace; comment)*.
&lt;&lt;Comments&gt;&gt;
&lt;&lt;Whitespace&gt;&gt;
</pre>
</div>

<p>
These tests can be run manually in a shell:
</p>
<pre class="example" id="orgca59a52">
for f in comments-*.txt ; \
    do markup-blitz.sh $f comment-tests.ixml ${f%.txt}.xml; \
    done
</pre>
<p>
I have no automatic checking of results:  the positive
examples should produce XML results which look plausible,
and the negative examples should all fail to parse.  A quick
check can be done with
</p>
<pre class="example" id="org10e4438">
grep ixml:state comments-*.xml
</pre>
</div>
</div>

<div id="outline-container-org6bd2622" class="outline-4">
<h4 id="org6bd2622"><span class="section-number-4">2.1.4.</span> Recapitulation (comments)</h4>
<div class="outline-text-4" id="text-2-1-4">
<p>
We can sum up these low-level rules thus:
</p>
<div class="org-src-container">
<pre class="src src-ixml" id="org4830bdf">
{ Basics:  names, whitespace, comments }
name = letter, namechar*.
-letter = [L].
-namechar = letter; digit; ["-_"].
-digit = [Nd].
-whitespace = -[Zs; #9; #A; #D].
-RS = (whitespace; comment)+.
-os = (whitespace; comment)*.
{ NL for required line breaks }
-NL = (-[Zs; #9] | comment)*, #A, os.
      comment = -"/*", comment-data, -"*/".
-comment-data = ("*"+, ~["/*"] 
                | "/"*, (comment | ~["/*"]))*, 
                "*"*.
</pre>
</div>
</div>
</div>
</div>
