W/W2024-05-fopc1234.org
** Propositional variables and constants

A propositional variable is a name.

In language XS, a propositional constant is a name enclosed in single
quotes.  In practice, we'll use typewriter apostrophes, but to allow
formulas to be copy-pasted from contexts which use proper quotation
marks, typeset quotation marks are also allowed (~‘...’~, ~‹...›~,
~›...‹~), as are (sigh) TeX-style single quotation marks (~`...'~).
We allow single guillemets in either order, because both
inward-pointing pairs and outward-pointing pairs are used.  (We have
seen claims that one is French practice and the other German practice,
but we believe we have seen both forms in German typesetting.)

#+name: XS-Atomics
#+begin_src ixml
{ XS Atomics:  propositional variables and constants }
prop-var = @name.
prop-constant = quoted-name; quoted-string.
-quoted-name = -#27, @name, -#27 
               { #27 is typewriter apostrophe }
             | -#60, @name, -#27 
               { #60 is typewriter grave accent }
             | -#2018, @name, -#2019 
               { hi 6, hi 9 }
             | -#203A, @name, -#2039 
               { single guillemets pointing in }
             | -#2039, @name, -#203A 
               { single guillemets pointing out }
             .
#+end_src

At this point, I am mildly tempted to allow arbitrary one-line strings
enclosed in double quotes, so as to make ~"Socrates is a Greek."~ and
="All Greeks are mortal."= allowable as propositional constants.  And,
after all, why not?
#+name: Quoted-strings
#+begin_src ixml
@quoted-string
      > string = -#22, (~[#22; #A]; (#22, #22))*, -#22
               | -#60, -#60, ~[#22; #60; #A]*, -#27, -#27 
               | -#60, -#60, ~[#22; #60; #A]*, -#22 
               | -#201C, ~[#201C; #201D; #A]*, -#201D
               | -#AB, ~[#AB; #BB; #A]*, -#BB
               | -#BB, ~[#AB; #BB; #A]*, -#AB
               .
#+end_src
For the record:
- #22 is a straight typewriter double quotation mark.
- #60 is a grave accent, often used doubled for
  a left double quotation mark by TeX users.
- #201C and #201D are typeset double quotation marks
  conventional in English-language typesetting
  (high 66, high 99).
- #AB and #BB are left- and right-pointing guillemets.
  We allow them to be paired pointing in or pointing
  out, because both styles may be encountered in
  European typesetting.
  
In the first form of quoted string, a double quotation mark in the
string may be represented by two double quotation marks in a row.  We
have not bothered with similar escape mechanisms in the other forms.

** Formulas

In language XS, a basic formula is a propositional variable, a propositional
constant, or a formula enclosed in parentheses.  We allow both round parentheses
and square brackets, to ease the reading of complex formulas.

#+begin_src ixml :noweb-ref XS-Basic-formulas
{ XS Basic formulas }
-basic-formula = prop-var | prop-constant 
               | -"(", os, -formula, os, -")"
               | -"[", os, -formula, os, -"]".
#+end_src

A /formula/ in general is a basic formula or one of several kinds of
compound formulas.
#+begin_src ixml :noweb-ref XS-Formulas
{ XS Formulas in general }
formula = basic-formula | compound-formula.
-compound-formula = not | and | or | implies | iff.
#+end_src

Each logical operator defines a distinct type of compound formula.
#+begin_src ixml :noweb-ref XS-Compound-formulas
{ Compound formulas }
    not = NOT+, basic-formula.
    and = basic-formula++AND, AND, (basic-formula | not).
     or = basic-formula++OR,  OR,  (basic-formula | not).
implies = basic-formula, IMPLIES, (basic-formula | not).
    iff = basic-formula, IFF, (basic-formula | not).
#+end_src

Note that /not/, /and/, and /or/ all allow multiple repetitions of the
operator without parentheses.  Since /and/ and /or/ are associative,
expressions like /A ∧ (B ∧ C)/ and /(A ∧ B) ∧ C/ always have the same
truth value, so there is no reason to require parentheses to specify
one structure or the other.

For conditionals and biconditionals, however, the left- and
right-associative interpretations of expressions like /A implies B
implies C/ or /A iff B iff C/ are not equivalent.  If there were a
principled, easily remembered rationale for choosing left or right
associativity, it would make sense to chose one or the other.  But we
see no such rationale.  To avoid confusion, we require parentheses
around nested occurrences of /implies/ and /iff/.

For the /not/ operator, there is only one imaginable structure, so the
parentheses in an expression like /¬(¬(¬p))/ are optional.  Similarly,
the scope of a negation symbol is clear if it applies to the
right-most operand of an /n/-ary or binary operator.  So /not/
expressions are allowed in those positions.  As a result, the
parentheses are necessary in =(¬p)∨q= and =¬(p∨q)= -- the
expression =¬p∨q= is ungrammatical -- but no parentheses are needed
in =p∨¬q=.

We might wish to consider adding other operators: /xor/ (or /aut/),
/nor/, /nand/.  But since we do not want those operators in language
M, and we want M to be a proper superset of XS, we leave them out.

