W/W2024-05-fopc1234.html

<div id="outline-container-org5db8eaa" class="outline-3">
<h3 id="org5db8eaa"><span class="section-number-3">2.2.</span> Propositional variables and constants</h3>
<div class="outline-text-3" id="text-2-2">
<p>
A propositional variable is a name.
</p>

<p>
In language XS, a propositional constant is a name enclosed in single
quotes.  In practice, we'll use typewriter apostrophes, but to allow
formulas to be copy-pasted from contexts which use proper quotation
marks, typeset quotation marks are also allowed (<code>‘...’</code>, <code>‹...›</code>,
<code>›...‹</code>), as are (sigh) TeX-style single quotation marks (<code>`...'</code>).
We allow single guillemets in either order, because both
inward-pointing pairs and outward-pointing pairs are used.  (We have
seen claims that one is French practice and the other German practice,
but we believe we have seen both forms in German typesetting.)
</p>

<div class="org-src-container">
<pre class="src src-ixml" id="orgf4e03c2">{ XS Atomics:  propositional variables and constants }
prop-var = @name.
prop-constant = quoted-name; quoted-string.
-quoted-name = -#27, @name, -#27 
               { #27 is typewriter apostrophe }
             | -#60, @name, -#27 
               { #60 is typewriter grave accent }
             | -#2018, @name, -#2019 
               { hi 6, hi 9 }
             | -#203A, @name, -#2039 
               { single guillemets pointing in }
             | -#2039, @name, -#203A 
               { single guillemets pointing out }
             .
</pre>
</div>

<p>
At this point, I am mildly tempted to allow arbitrary one-line strings
enclosed in double quotes, so as to make <code>"Socrates is a Greek."</code> and
<code>"All Greeks are mortal."</code> allowable as propositional constants.  And,
after all, why not?
</p>
<div class="org-src-container">
<pre class="src src-ixml" id="org72e7180">@quoted-string
      &gt; string = -#22, (~[#22; #A]; (#22, #22))*, -#22
               | -#60, -#60, ~[#22; #60; #A]*, -#27, -#27 
               | -#60, -#60, ~[#22; #60; #A]*, -#22 
               | -#201C, ~[#201C; #201D; #A]*, -#201D
               | -#AB, ~[#AB; #BB; #A]*, -#BB
               | -#BB, ~[#AB; #BB; #A]*, -#AB
               .
</pre>
</div>
<p>
For the record:
</p>
<ul class="org-ul">
<li>#22 is a straight typewriter double quotation mark.</li>
<li>#60 is a grave accent, often used doubled for
a left double quotation mark by TeX users.</li>
<li>#201C and #201D are typeset double quotation marks
conventional in English-language typesetting
(high 66, high 99).</li>
<li>#AB and #BB are left- and right-pointing guillemets.
We allow them to be paired pointing in or pointing
out, because both styles may be encountered in
European typesetting.</li>
</ul>

<p>
In the first form of quoted string, a double quotation mark in the
string may be represented by two double quotation marks in a row.  We
have not bothered with similar escape mechanisms in the other forms.
</p>
</div>
</div>

<div id="outline-container-org407e593" class="outline-3">
<h3 id="org407e593"><span class="section-number-3">2.3.</span> Formulas</h3>
<div class="outline-text-3" id="text-2-3">
<p>
In language XS, a basic formula is a propositional variable, a propositional
constant, or a formula enclosed in parentheses.  We allow both round parentheses
and square brackets, to ease the reading of complex formulas.
</p>

<div class="org-src-container">
<pre class="src src-ixml">{ XS Basic formulas }
-basic-formula = prop-var | prop-constant 
               | -"(", os, -formula, os, -")"
               | -"[", os, -formula, os, -"]".
</pre>
</div>

<p>
A <i>formula</i> in general is a basic formula or one of several kinds of
compound formulas.
</p>
<div class="org-src-container">
<pre class="src src-ixml">{ XS Formulas in general }
formula = basic-formula | compound-formula.
-compound-formula = not | and | or | implies | iff.
</pre>
</div>

<p>
Each logical operator defines a distinct type of compound formula.
</p>
<div class="org-src-container">
<pre class="src src-ixml">{ Compound formulas }
    not = NOT+, basic-formula.
    and = basic-formula++AND, AND, (basic-formula | not).
     or = basic-formula++OR,  OR,  (basic-formula | not).
implies = basic-formula, IMPLIES, (basic-formula | not).
    iff = basic-formula, IFF, (basic-formula | not).
</pre>
</div>

<p>
Note that <i>not</i>, <i>and</i>, and <i>or</i> all allow multiple repetitions of the
operator without parentheses.  Since <i>and</i> and <i>or</i> are associative,
expressions like <i>A ∧ (B ∧ C)</i> and <i>(A ∧ B) ∧ C</i> always have the same
truth value, so there is no reason to require parentheses to specify
one structure or the other.
</p>

<p>
For conditionals and biconditionals, however, the left- and
right-associative interpretations of expressions like <i>A implies B
implies C</i> or <i>A iff B iff C</i> are not equivalent.  If there were a
principled, easily remembered rationale for choosing left or right
associativity, it would make sense to chose one or the other.  But we
see no such rationale.  To avoid confusion, we require parentheses
around nested occurrences of <i>implies</i> and <i>iff</i>.
</p>

<p>
For the <i>not</i> operator, there is only one imaginable structure, so the
parentheses in an expression like <i>¬(¬(¬p))</i> are optional.  Similarly,
the scope of a negation symbol is clear if it applies to the
right-most operand of an <i>n</i>-ary or binary operator.  So <i>not</i>
expressions are allowed in those positions.  As a result, the
parentheses are necessary in <code>(¬p)∨q</code> and <code>¬(p∨q)</code> &#x2013; the
expression <code>¬p∨q</code> is ungrammatical &#x2013; but no parentheses are needed
in <code>p∨¬q</code>.
</p>

<p>
We might wish to consider adding other operators: <i>xor</i> (or <i>aut</i>),
<i>nor</i>, <i>nand</i>.  But since we do not want those operators in language
M, and we want M to be a proper superset of XS, we leave them out.
</p>
</div>
</div>
