W/W2024-05-fopc1234.org
** Logical Operators
For each operator, we seek to allow a wide variety of different forms:
symbols used in logic textbooks, symbols and keywords used in systems
like Alloy or TLA+ or Z, symbols, keywords, and character sequences
used in combination programming language / theorem provers like ACL2,
Lean, and Agda.  /Not/ included: operators for C.

For the record, a survey of some sources shows the following:
|------------+--------------+---------------+------------------+-----------+---------------+--------+--------|
| Source     | not          | and           | or               | implies   | iff           | forall | exists |
|------------+--------------+---------------+------------------+-----------+---------------+--------+--------|
| Jeffrey    | —            | &             | ∨                | →         | ↔             | (x)    | (∃x)   |
| unnamed*   | ~, ⁓         | ·             | +                | ⊃         | ≡             | ⋀x, Πx | ⋁x, Σx |
| Quine 1941 | ⁓, p̄         | ·             | ∨                | ⊃         | ≡             | (x)    | (∃x)   |
| Smullyan   | ⁓            | ∧             | ∨                | ⊃         | ↔             | ∀x     | ∃x     |
| Quine 1950 | —, p̄         |               | ∨                | →         | ↔             | ∀x     | ∃x     |
| Alloy      | not          | and           | or \zwnj         | implies   | iff           | all x  | some x |
|            | !            | &&            | \vert\vert \zwnj | \zwnj{}=> | <=>           | all x  | some x |
| TLA+       | ¬            | ∧             | ∨                | ⇒         | ≡             | ∀x     | ∃x     |
| TLA+ ASCII | ~            | /\            | \/               | ﻿=>        | <=>           |        |        |
|            | \lnot        | \\zwnj{}land  | \\zwnj{}lor      |           | \\zwnj{}equiv |        |        |
|            | \\zwnj{}neg  |               |                  |           |               |        |        |
| Agda ASCII | \\zwnj{}lnot | \\zwnj{}and   | \\zwnj{}or       |           |               |        |        |
|            | \\zwnj{}neg  | \\zwnj{}wedge | \\zwnj{}vee      |           |               |        |        |
|------------+--------------+---------------+------------------+-----------+---------------+--------+--------|

,* Notes:
- The row labeled 'unnamed' is from Jeffrey's appendix on notation.
- Quine 1941 is /Element logic/, revised edition.
- Smullyan is /First-order logic/.
- Quine 1950 is /Methods of logic/. Conjunction is expressed by
  juxtaposition (and identifiers for propositions are in consequence
  restricted to single characters).
- Alloy also allows double bar (~||~) for disjunction.  It defines
  the additional quantifiers *no*, *lone*, and *one*.
- Agda presumably does have an implication symbol (and equivalence,
  and so on), but I have not progressed far enough to know what it is.

Quine notes that swung dash (⁓) sometimes is used with the
meaning 'iff'.

#+begin_src ixml :noweb-ref Logical-operators
{ Logical operators }
@NOT > op = NOT-sym, os
          | NOT-alpha, RS
          .
NOT-alpha = "not" | "NOT".
  NOT-sym = "¬" { #AC not sign }
          | "-"
          | "—" { #2014 em dash }
          | "~" { #7E tilde }
          | "⁓" { #2053 swung dash }
          . 

@AND > op = os, AND-sym, os
          | RS, AND-alpha, RS
          .
AND-alpha = "and" | "AND"
          | "\land" | "\and" 
          | "\wedge"
          .
  AND-sym = "∧" { #2227 }
          | "&"
          | "&&"
          | "/\" { emacs here wants a " }
          .

 @OR > op = os, OR-sym, os
          | RS, OR-alpha, RS
          .
 OR-alpha = "or" | "OR" 
          | "vel" | "VEL" 
          | "\lor" | "\or" | "\vee"
          .
   OR-sym = "∨" { #2228 logical or }
          | "|" 
          | "||"
          | "\/"
          . 
@IMPLIES > op = os, IMPLIES-sym, os
              | RS, IMPLIES-alpha, RS. 
IMPLIES-alpha = "implies" | "IMPLIES" 
              | "only", os, "if" 
              | "ONLY", os, "IF"
              .
  IMPLIES-sym = "⇒" { #21D2 right double arrow } 
              | "⊃" { #2283 superset of }
              | "→" { #2192 right arrow }
              | "->"
              | "=>"
              .

@IFF > op = os, IFF-sym, os
          | RS, IFF-alpha, RS.
IFF-alpha = "iff" | "IFF"; "\equiv".
  IFF-sym = "⇔" { #21D4 left right double arrow }
          | "↔" { #2194 left right arrow }
          | "≡" { #2261 identical to }
          | "<->"
          | "<=>"
          .
#+end_src
** Recapitulation
The entire XS grammar can now be summarized:
#+begin_src ixml :tangle xs.ixml :noweb tangle
ixml version "1.1".

{ xs.ixml:  grammar for sentential logic }
xs-formulas = os, formula++NL, os.
<<XS-Formulas>>
<<XS-Compound-formulas>>
<<XS-Basic-formulas>>

<<XS-Atomics>>
<<Quoted-strings>>

<<Logical-operators>>

<<Basics>>
#+end_src

