W/W2024-05-fopc1234.html

<div id="outline-container-orgf69aa36" class="outline-3">
<h3 id="orgf69aa36"><span class="section-number-3">2.4.</span> Logical Operators</h3>
<div class="outline-text-3" id="text-2-4">
<p>
For each operator, we seek to allow a wide variety of different forms:
symbols used in logic textbooks, symbols and keywords used in systems
like Alloy or TLA+ or Z, symbols, keywords, and character sequences
used in combination programming language / theorem provers like ACL2,
Lean, and Agda.  <i>Not</i> included: operators for C.
</p>

<p>
For the record, a survey of some sources shows the following:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Source</th>
<th scope="col" class="org-left">not</th>
<th scope="col" class="org-left">and</th>
<th scope="col" class="org-left">or</th>
<th scope="col" class="org-left">implies</th>
<th scope="col" class="org-left">iff</th>
<th scope="col" class="org-left">forall</th>
<th scope="col" class="org-left">exists</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Jeffrey</td>
<td class="org-left">—</td>
<td class="org-left">&amp;</td>
<td class="org-left">∨</td>
<td class="org-left">→</td>
<td class="org-left">↔</td>
<td class="org-left">(x)</td>
<td class="org-left">(∃x)</td>
</tr>

<tr>
<td class="org-left">unnamed*</td>
<td class="org-left">~, ⁓</td>
<td class="org-left">·</td>
<td class="org-left">+</td>
<td class="org-left">⊃</td>
<td class="org-left">≡</td>
<td class="org-left">⋀x, Πx</td>
<td class="org-left">⋁x, Σx</td>
</tr>

<tr>
<td class="org-left">Quine 1941</td>
<td class="org-left">⁓, p̄</td>
<td class="org-left">·</td>
<td class="org-left">∨</td>
<td class="org-left">⊃</td>
<td class="org-left">≡</td>
<td class="org-left">(x)</td>
<td class="org-left">(∃x)</td>
</tr>

<tr>
<td class="org-left">Smullyan</td>
<td class="org-left">⁓</td>
<td class="org-left">∧</td>
<td class="org-left">∨</td>
<td class="org-left">⊃</td>
<td class="org-left">↔</td>
<td class="org-left">∀x</td>
<td class="org-left">∃x</td>
</tr>

<tr>
<td class="org-left">Quine 1950</td>
<td class="org-left">—, p̄</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">∨</td>
<td class="org-left">→</td>
<td class="org-left">↔</td>
<td class="org-left">∀x</td>
<td class="org-left">∃x</td>
</tr>

<tr>
<td class="org-left">Alloy</td>
<td class="org-left">not</td>
<td class="org-left">and</td>
<td class="org-left">or &zwnj;</td>
<td class="org-left">implies</td>
<td class="org-left">iff</td>
<td class="org-left">all x</td>
<td class="org-left">some x</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">!</td>
<td class="org-left">&amp;&amp;</td>
<td class="org-left">&vert;&vert; &zwnj;</td>
<td class="org-left">&zwnj;=&gt;</td>
<td class="org-left">&lt;=&gt;</td>
<td class="org-left">all x</td>
<td class="org-left">some x</td>
</tr>

<tr>
<td class="org-left">TLA+</td>
<td class="org-left">¬</td>
<td class="org-left">∧</td>
<td class="org-left">∨</td>
<td class="org-left">⇒</td>
<td class="org-left">≡</td>
<td class="org-left">∀x</td>
<td class="org-left">∃x</td>
</tr>

<tr>
<td class="org-left">TLA+ ASCII</td>
<td class="org-left">~</td>
<td class="org-left">/\</td>
<td class="org-left">\/</td>
<td class="org-left">﻿=&gt;</td>
<td class="org-left">&lt;=&gt;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">\lnot</td>
<td class="org-left">\&zwnj;land</td>
<td class="org-left">\&zwnj;lor</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">\&zwnj;equiv</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">\&zwnj;neg</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Agda ASCII</td>
<td class="org-left">\&zwnj;lnot</td>
<td class="org-left">\&zwnj;and</td>
<td class="org-left">\&zwnj;or</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">\&zwnj;neg</td>
<td class="org-left">\&zwnj;wedge</td>
<td class="org-left">\&zwnj;vee</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
,* Notes:
</p>
<ul class="org-ul">
<li>The row labeled 'unnamed' is from Jeffrey's appendix on notation.</li>
<li>Quine 1941 is <i>Element logic</i>, revised edition.</li>
<li>Smullyan is <i>First-order logic</i>.</li>
<li>Quine 1950 is <i>Methods of logic</i>. Conjunction is expressed by
juxtaposition (and identifiers for propositions are in consequence
restricted to single characters).</li>
<li>Alloy also allows double bar (<code>||</code>) for disjunction.  It defines
the additional quantifiers <b>no</b>, <b>lone</b>, and <b>one</b>.</li>
<li>Agda presumably does have an implication symbol (and equivalence,
and so on), but I have not progressed far enough to know what it is.</li>
</ul>

<p>
Quine notes that swung dash (⁓) sometimes is used with the
meaning 'iff'.
</p>

<div class="org-src-container">
<pre class="src src-ixml">{ Logical operators }
@NOT &gt; op = NOT-sym, os
          | NOT-alpha, RS
          .
NOT-alpha = "not" | "NOT".
  NOT-sym = "¬" { #AC not sign }
          | "-"
          | "—" { #2014 em dash }
          | "~" { #7E tilde }
          | "⁓" { #2053 swung dash }
          . 

@AND &gt; op = os, AND-sym, os
          | RS, AND-alpha, RS
          .
AND-alpha = "and" | "AND"
          | "\land" | "\and" 
          | "\wedge"
          .
  AND-sym = "∧" { #2227 }
          | "&amp;"
          | "&amp;&amp;"
          | "/\" { emacs here wants a " }
          .

 @OR &gt; op = os, OR-sym, os
          | RS, OR-alpha, RS
          .
 OR-alpha = "or" | "OR" 
          | "vel" | "VEL" 
          | "\lor" | "\or" | "\vee"
          .
   OR-sym = "∨" { #2228 logical or }
          | "|" 
          | "||"
          | "\/"
          . 
@IMPLIES &gt; op = os, IMPLIES-sym, os
              | RS, IMPLIES-alpha, RS. 
IMPLIES-alpha = "implies" | "IMPLIES" 
              | "only", os, "if" 
              | "ONLY", os, "IF"
              .
  IMPLIES-sym = "⇒" { #21D2 right double arrow } 
              | "⊃" { #2283 superset of }
              | "→" { #2192 right arrow }
              | "-&gt;"
              | "=&gt;"
              .

@IFF &gt; op = os, IFF-sym, os
          | RS, IFF-alpha, RS.
IFF-alpha = "iff" | "IFF"; "\equiv".
  IFF-sym = "⇔" { #21D4 left right double arrow }
          | "↔" { #2194 left right arrow }
          | "≡" { #2261 identical to }
          | "&lt;-&gt;"
          | "&lt;=&gt;"
          .
</pre>
</div>
</div>
</div>
<div id="outline-container-org215b4cd" class="outline-3">
<h3 id="org215b4cd"><span class="section-number-3">2.5.</span> Recapitulation</h3>
<div class="outline-text-3" id="text-2-5">
<p>
The entire XS grammar can now be summarized:
</p>
<div class="org-src-container">
<pre class="src src-ixml">ixml version "1.1".

{ xs.ixml:  grammar for sentential logic }
xs-formulas = os, formula++NL, os.
&lt;&lt;XS-Formulas&gt;&gt;
&lt;&lt;XS-Compound-formulas&gt;&gt;
&lt;&lt;XS-Basic-formulas&gt;&gt;

&lt;&lt;XS-Atomics&gt;&gt;
&lt;&lt;Quoted-strings&gt;&gt;

&lt;&lt;Logical-operators&gt;&gt;

&lt;&lt;Basics&gt;&gt;
</pre>
</div>
</div>
</div>
