W/W2024-05-fopc1234.org
** Tests
Some simple positive tests for language XS follow.
First, some propositional variables.
#+begin_src data :noweb-ref XS-Tests-vars
/* Some basic formulas */
/* Propositional variables */
p
q
Prop-2a
φ
א
/* and */
#+end_src
Note that the string "and" is a propositional
variable as well as a logical operator for
conjunction. Parsed as a formula, however, it
can only be the latter.  In the context "A and B"
or "p and q", it can only be the former.
(In the test context, it can be either, however,
so I commented it back out.)

Then, some propositional constants.
#+begin_src data :noweb-ref XS-Tests-constants
/* Propositional constants */
'Prop-2a'
›Frege-was-born-in-1848‹
‹Russell-died-in-1970›
`Prop-2b'

/* Double-quoted strings as propositional constants */
"Frege was born in 1848"
``he is at his desk''
“he is eating lunch”
#+end_src

Then, some propositional constants.
#+begin_src data :noweb-ref XS-Tests-parens-basic
/* Parenthesized basic formulas */
(q)
( Prop-2a )
[(φ)]
['Prop-2a' ]
#+end_src

And now, finally, some compound formulas:
#+begin_src data :noweb-ref XS-Tests-compounds
/* Compound formulas */
(p iff (q&r)) only if (p && q)
(p implies (q & r)) iff (p ∧ q)
(p ∨ q) implies r
p ∨ (q implies r)
p implies (q or r)
"Jones is here" and "Smith is away"
[([(p∨q) ∧ (p∨-q)] ∨ [(-p)∧q]) ⇔ q] ⇒ [(p∧r) ∨ (p∧~r)]
#+end_src

Bringing all the positive examples together,
we have:
#+begin_src data :tangle ../tests/xs-pos-01.txt :noweb tangle
<<XS-Tests-vars>>
<<XS-Tests-constants>>
<<XS-Tests-parens-basic>>
<<XS-Tests-compounds>>
#+end_src
Some negative examples should be added.  But for
now, this may suffice.

* Language S:  first-order logic

Language S adds the following constructs to language XS:
- universal and existential quantification
- constants and variables denoting individuals rather than propositions

** Note on different uses of identifiers 
At thyis point, several classes of names must be distinguished:
- variables ranging over propositions
- constants denoting specific propositions
- variables ranging over individuals
- constants denoting specific individuals
- predicate names (always constants)
- functors (always constants; not present in language S,
  but added in M)

|--------------+---------------+---------------|
|              | Propositions  | Individuals   |
|--------------+---------------+---------------|
| no arguments | Propositional | (Individual)  |
|              | variables     | variables     |
|              | and constants | and constants |
|--------------+---------------+---------------|
| /n/-ary      | Predicate     | Functors      |
|              | names         |               |
|--------------+---------------+---------------|

In some usages, syntactic distinctions are made for these classes of
names (lower- vs upper-case, regions of the alphabet, Latin vs Greek
letters), but in those usages identifiers are typically also limited
to single characters and empirically the identifiers seldom have much
mnemonic value.  Here, the distinctions are made as follows:
- Expressions denoting individuals and those denoting propositions are
  distinguished by context: an entire formula expresses a proposition,
  while an argument to a predicate or functor denotes an individual.
- For expressions with arguments, the functor or predicate name is
  always taken to be a constant: allowing variables would make it a
  higher-order logic.
- In expressions without arguments, the distinction between variables
  and constants is made as above in XS: variables are unmarked,
  constants marked.

/(TBD:  eliminate propositional variables and constants?)/

** Variables and constants
The definitions of /prop-var/ and /prop-constant/ from XS
can be re-used without change.

In addition, we will need variables and constants for
individuals; they will have the same syntax.
#+begin_src ixml :noweb-ref S-Atomics
{ S-Atomics:  terms for individuals }
var = @name.
constant = quoted-name; numeral.
@numeral > name = digit+.
#+end_src

** Predicates
In language S, propositions can take the form of a predicate
symbol followed by a parenthesized list of arguments separated
by commas (and whitespace).  Arguments are variables or constants
denoting individuals.
#+begin_src ixml :noweb-ref Predicates
{ Predicates }
predicate = @name, -"(", os, arg**comma, os, -")".
-arg = var; constant.
-comma = os, -",", os.
#+end_src

Note:
- No whitespace is allowed between the predicate name and the opening
  parenthesis for the list of arguments.
- The argument list must be surrounded by round parentheses; square
  brackets or other forms of brackets are not accepted.

** Quantification
If /F/ is a formula, then /F/ preceded by a universal or existential
quantifier is a formula.  This is a universal or existential
quantification symbol (/FORALL/ or /THERE-EXIST/) followed by one or
more variables, the entire quantifier enclosed in (round) parentheses.
For universal quantification over a single variable, the operator can
be omitted (so "~(x)~" is allowed as an alternate for "~(all x)~").
Whitespace is optional after symbols, required after operators spelled
out with letters.
#+begin_src ixml :noweb-ref Quantification
{ Quantified formulas }
all = universal-quantifier, bracketed-formula.
exist = existential-quantifier, bracketed-formula.

-universal-quantifier = 
        -"(", os, FORALL-sym, os, vars, os, -")"
      | -"(", os, FORALL-lex, RS, vars, os, -")"
      | -"(", os, one-var, os, -")"
      .
-existential-quantifier = 
        -"(", os, EXIST-sym, os, vars, os, -")"
      | -"(", os, EXIST-lex, RS, vars, os, -")"
      .
@vars = var ++ comma-space.
@one-var > vars = var.
-comma-space = os, -",", os, +" ".
#+end_src

As for the logical operators, we allow fairly wide variation in
the spelling of the quantification symbols.
#+begin_src ixml :noweb-ref Quantifier-ops
{ Operators for quantifiers }
@FORALL-lex > op = "all" | "ALL"
      | "for", os, "all" | "FOR", os, "ALL"
      | "A"
      .
@FORALL-sym > op = "∀" { #2200 for all }
      .
@EXIST-lex > op = "exists" | "EXISTS"
      | "exist" | "EXIST"
      | "some" | "SOME"
      | "E"
      .
@EXIST-sym > op = "∃" { #2203 there exists }
      .
#+end_src
  
