W/W2024-05-fopc1234.html

<div id="outline-container-orgb589eec" class="outline-3">
<h3 id="orgb589eec"><span class="section-number-3">2.6.</span> Tests</h3>
<div class="outline-text-3" id="text-2-6">
<p>
Some simple positive tests for language XS follow.
First, some propositional variables.
</p>
<div class="org-src-container">
<pre class="src src-data">/* Some basic formulas */
/* Propositional variables */
p
q
Prop-2a
φ
א
/* and */
</pre>
</div>
<p>
Note that the string "and" is a propositional
variable as well as a logical operator for
conjunction. Parsed as a formula, however, it
can only be the latter.  In the context "A and B"
or "p and q", it can only be the former.
(In the test context, it can be either, however,
so I commented it back out.)
</p>

<p>
Then, some propositional constants.
</p>
<div class="org-src-container">
<pre class="src src-data">/* Propositional constants */
'Prop-2a'
›Frege-was-born-in-1848‹
‹Russell-died-in-1970›
`Prop-2b'

/* Double-quoted strings as propositional constants */
"Frege was born in 1848"
``he is at his desk''
“he is eating lunch”
</pre>
</div>

<p>
Then, some propositional constants.
</p>
<div class="org-src-container">
<pre class="src src-data">/* Parenthesized basic formulas */
(q)
( Prop-2a )
[(φ)]
['Prop-2a' ]
</pre>
</div>

<p>
And now, finally, some compound formulas:
</p>
<div class="org-src-container">
<pre class="src src-data">/* Compound formulas */
(p iff (q&amp;r)) only if (p &amp;&amp; q)
(p implies (q &amp; r)) iff (p ∧ q)
(p ∨ q) implies r
p ∨ (q implies r)
p implies (q or r)
"Jones is here" and "Smith is away"
[([(p∨q) ∧ (p∨-q)] ∨ [(-p)∧q]) ⇔ q] ⇒ [(p∧r) ∨ (p∧~r)]
</pre>
</div>

<p>
Bringing all the positive examples together,
we have:
</p>
<div class="org-src-container">
<pre class="src src-data">&lt;&lt;XS-Tests-vars&gt;&gt;
&lt;&lt;XS-Tests-constants&gt;&gt;
&lt;&lt;XS-Tests-parens-basic&gt;&gt;
&lt;&lt;XS-Tests-compounds&gt;&gt;
</pre>
</div>
<p>
Some negative examples should be added.  But for
now, this may suffice.
</p>
</div>
</div>
</div>

<div id="outline-container-orgd98042b" class="outline-2">
<h2 id="orgd98042b"><span class="section-number-2">3.</span> Language S:  first-order logic</h2>
<div class="outline-text-2" id="text-3">
<p>
Language S adds the following constructs to language XS:
</p>
<ul class="org-ul">
<li>universal and existential quantification</li>
<li>constants and variables denoting individuals rather than propositions</li>
</ul>
</div>

<div id="outline-container-orgb687815" class="outline-3">
<h3 id="orgb687815"><span class="section-number-3">3.1.</span> Note on different uses of identifiers</h3>
<div class="outline-text-3" id="text-3-1">
<p>
At thyis point, several classes of names must be distinguished:
</p>
<ul class="org-ul">
<li>variables ranging over propositions</li>
<li>constants denoting specific propositions</li>
<li>variables ranging over individuals</li>
<li>constants denoting specific individuals</li>
<li>predicate names (always constants)</li>
<li>functors (always constants; not present in language S,
but added in M)</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Propositions</th>
<th scope="col" class="org-left">Individuals</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">no arguments</td>
<td class="org-left">Propositional</td>
<td class="org-left">(Individual)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">variables</td>
<td class="org-left">variables</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">and constants</td>
<td class="org-left">and constants</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><i>n</i>-ary</td>
<td class="org-left">Predicate</td>
<td class="org-left">Functors</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">names</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
In some usages, syntactic distinctions are made for these classes of
names (lower- vs upper-case, regions of the alphabet, Latin vs Greek
letters), but in those usages identifiers are typically also limited
to single characters and empirically the identifiers seldom have much
mnemonic value.  Here, the distinctions are made as follows:
</p>
<ul class="org-ul">
<li>Expressions denoting individuals and those denoting propositions are
distinguished by context: an entire formula expresses a proposition,
while an argument to a predicate or functor denotes an individual.</li>
<li>For expressions with arguments, the functor or predicate name is
always taken to be a constant: allowing variables would make it a
higher-order logic.</li>
<li>In expressions without arguments, the distinction between variables
and constants is made as above in XS: variables are unmarked,
constants marked.</li>
</ul>

<p>
<i>(TBD:  eliminate propositional variables and constants?)</i>
</p>
</div>
</div>

<div id="outline-container-orgcedf164" class="outline-3">
<h3 id="orgcedf164"><span class="section-number-3">3.2.</span> Variables and constants</h3>
<div class="outline-text-3" id="text-3-2">
<p>
The definitions of <i>prop-var</i> and <i>prop-constant</i> from XS
can be re-used without change.
</p>

<p>
In addition, we will need variables and constants for
individuals; they will have the same syntax.
</p>
<div class="org-src-container">
<pre class="src src-ixml">{ S-Atomics:  terms for individuals }
var = @name.
constant = quoted-name; numeral.
@numeral &gt; name = digit+.
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcb42580" class="outline-3">
<h3 id="orgcb42580"><span class="section-number-3">3.3.</span> Predicates</h3>
<div class="outline-text-3" id="text-3-3">
<p>
In language S, propositions can take the form of a predicate
symbol followed by a parenthesized list of arguments separated
by commas (and whitespace).  Arguments are variables or constants
denoting individuals.
</p>
<div class="org-src-container">
<pre class="src src-ixml">{ Predicates }
predicate = @name, -"(", os, arg**comma, os, -")".
-arg = var; constant.
-comma = os, -",", os.
</pre>
</div>

<p>
Note:
</p>
<ul class="org-ul">
<li>No whitespace is allowed between the predicate name and the opening
parenthesis for the list of arguments.</li>
<li>The argument list must be surrounded by round parentheses; square
brackets or other forms of brackets are not accepted.</li>
</ul>
</div>
</div>

<div id="outline-container-orgd02453d" class="outline-3">
<h3 id="orgd02453d"><span class="section-number-3">3.4.</span> Quantification</h3>
<div class="outline-text-3" id="text-3-4">
<p>
If <i>F</i> is a formula, then <i>F</i> preceded by a universal or existential
quantifier is a formula.  This is a universal or existential
quantification symbol (<i>FORALL</i> or <i>THERE-EXIST</i>) followed by one or
more variables, the entire quantifier enclosed in (round) parentheses.
For universal quantification over a single variable, the operator can
be omitted (so "<code>(x)</code>" is allowed as an alternate for "<code>(all x)</code>").
Whitespace is optional after symbols, required after operators spelled
out with letters.
</p>
<div class="org-src-container">
<pre class="src src-ixml">{ Quantified formulas }
all = universal-quantifier, bracketed-formula.
exist = existential-quantifier, bracketed-formula.

-universal-quantifier = 
        -"(", os, FORALL-sym, os, vars, os, -")"
      | -"(", os, FORALL-lex, RS, vars, os, -")"
      | -"(", os, one-var, os, -")"
      .
-existential-quantifier = 
        -"(", os, EXIST-sym, os, vars, os, -")"
      | -"(", os, EXIST-lex, RS, vars, os, -")"
      .
@vars = var ++ comma-space.
@one-var &gt; vars = var.
-comma-space = os, -",", os, +" ".
</pre>
</div>

<p>
As for the logical operators, we allow fairly wide variation in
the spelling of the quantification symbols.
</p>
<div class="org-src-container">
<pre class="src src-ixml">{ Operators for quantifiers }
@FORALL-lex &gt; op = "all" | "ALL"
      | "for", os, "all" | "FOR", os, "ALL"
      | "A"
      .
@FORALL-sym &gt; op = "∀" { #2200 for all }
      .
@EXIST-lex &gt; op = "exists" | "EXISTS"
      | "exist" | "EXIST"
      | "some" | "SOME"
      | "E"
      .
@EXIST-sym &gt; op = "∃" { #2203 there exists }
      .
</pre>
</div>
</div>
</div>
