W/W2024-05-fopc1234.org
** Formulas
In language S, the set of basic formulas grows to include
predicates.  Since quantified formulas require bracketing,
they are defined as bracketed formulas.
#+begin_src ixml :noweb-ref S-Basic-formulas
{ S: Basic formulas }
-basic-formula = 
        prop-var 
      | prop-constant 
      | predicate
      | bracketed-formula
      .
-bracketed-formula =  
        -"(", os, -formula, os, -")"
      | -"[", os, -formula, os, -"]"
      | all 
      | exist
      .
#+end_src

The set of all formulas grows to include quantified formulas.
(/Actually, this is now the same as XS, since quantification
was introduced elsewhere./)
#+begin_src ixml :noweb-ref S-Formulas
{ S: Formulas in general }
formula = basic-formula | compound-formula.
-compound-formula = 
        not 
      | and | or 
      | implies | iff
      .
#+end_src

** Recapitulation of language S
The grammar of language S can be summarized:
#+begin_src ixml :tangle s.ixml :noweb tangle
ixml version "1.1".

{ s.ixml:  grammar for first-order logic
  (without identity or functions) }
s-formulas = os, formula++NL, os.
<<S-Formulas>>
<<XS-Compound-formulas>>
<<Quantification>>
<<S-Basic-formulas>>

<<Predicates>>
<<XS-Atomics>>
<<S-Atomics>>
<<Quoted-strings>>

<<Logical-operators>>
<<Quantifier-ops>>

<<Basics>>
#+end_src

** Tests for language S
All tests for language XS can also serve as tests for language S.
So the tests below focus on the new parts of XS.

Let's show some simple predicates.
#+begin_src data :noweb-ref XS-Tests-predicates
/* Predicates */
P(x)
Q(x, y, z)
born('Frege', 1848)
born('Frege', ‹anno-1848›)
born(`Frege', ١٨٤٨)
p()
Φ(x) /\ Δ(υ, ζ)
#+end_src

No whitespace before the parenthesis:
#+begin_src data :tangle ../tests/s-neg-01.txt
P (x)
#+end_src

Double-quoted constants denote propositions, not individuals.  So
~logician("Frege")~ is not grammatical.
#+begin_src data :tangle ../tests/s-neg-02.txt
logician("Frege")
#+end_src

Single quoting is not required (and not allowed) for numerals:
#+begin_src data :tangle ../tests/s-neg-03.txt
born('Frege', ‹1848›)
#+end_src

Quantification is, of course, the main thing:
#+begin_src data :noweb-ref XS-Tests-quantification
(all p)(philosopher(p) implies (some d)(born(p, d)))
(∀ p)(philosopher(p) ⇒ (∃ d)(born(p, d)))
(forall n)(natural(n) implies (exists m)(next(n, m)))
(A n)(natural(n) implies (E m)(next(n, m)))
(~(ALL x)[P(x)]) → (EXISTS x)(~P(x))
#+end_src

Summing it up:
#+begin_src data :tangle ../tests/s-pos-01.txt :noweb tangle
<<XS-Tests-predicates>>

<<XS-Tests-quantification>>
#+end_src

* Language M:  first-order logic with identity and functions

Vis-a-vis language S, language M adds:
- identity and the symbol "~=~"
- functions

Since the function syntax always uses parentheses, and functors are
always constants, language M extends the mechanisms for referring to
an individual: a specific individual can be referred to either by
using a constant like "~'f'~" or "~‹f›~" or by using a zero-argument
function expression like "~f()~".

[Full definition to be supplied.]

* Language L:  additional convenience features

Language L adds a number of convenience features to language M:
- typed quantifications (for all /x/ of type /T/, ...; there is
  some /x/ of type /T/ such that ...)
- unique existential quantification (there exists exactly one
  individual such that ...)
- Skolem expressions (the unique individual who ...)
- negated existential quantification (there is no /x/ such that ...)
- /lone/ existential quantification (there is at most one /x/ such
  that ...)

These are all intended as idioms for concise expression of commonly
used patterns; for each new construct, we specify a standard
translation into language M.

[Full definition to be supplied.]

* Language XL: first-order logic plus set theory

Language XS adds sets /(and tuples? tbd)/ to the universe of
discourse.  Concretely it adds:
- the ability to declare variables as denoting sets of a given type
- syntax for tuples
- the ability to declare variables as denoting tuples in a given
  relation (with symbols allowing the user to distinguish total
  from partial functions, injections, and bijections) 
- symbols for standard set operations (membership, complementation,
  union, intersection, subset relation, set difference)
- set comprehensions

/(The inclusion of tuples, set comprehensions, and various forms of
functions and relations is uncertain.  Our initial instinct was to
exclude them for simplicity and reliability, since the ground has
proved so treacherous for so many.  But it may be that once sets are
added, we have tuples and relations whether we want them or not.  And
in that case, we might as well have set comprehensions to make them
easier to talk about.)/

[Full definition to be supplied.]

* Concluding notes
The grammars defined here have two intended functions:
- They provide specific targets for programs we write
  which are to translate some notation or other into
  'conventional first-order logic'.  That is, they allow
  that vague description to be replaced by a statement
  that the program's output is or should be sentences
  in one of the languages defined here.
- They make it easy to translate formulas into XML form
  so they can be processed by XSLT or XQuery programs.  
  We may write pretty-printers, normalizers, and (of course)
  translations into specific target notations like ACL2
  or TPTP FOF or TFF.
  
** To do
Watch this space.

- Create minimal test case exhibiting /vars/ problem, report.
  
