W/W2024-05-fopc1234.html

<div id="outline-container-orgee67e78" class="outline-3">
<h3 id="orgee67e78"><span class="section-number-3">3.5.</span> Formulas</h3>
<div class="outline-text-3" id="text-3-5">
<p>
In language S, the set of basic formulas grows to include
predicates.  Since quantified formulas require bracketing,
they are defined as bracketed formulas.
</p>
<div class="org-src-container">
<pre class="src src-ixml">{ S: Basic formulas }
-basic-formula = 
        prop-var 
      | prop-constant 
      | predicate
      | bracketed-formula
      .
-bracketed-formula =  
        -"(", os, -formula, os, -")"
      | -"[", os, -formula, os, -"]"
      | all 
      | exist
      .
</pre>
</div>

<p>
The set of all formulas grows to include quantified formulas.
(<i>Actually, this is now the same as XS, since quantification
was introduced elsewhere.</i>)
</p>
<div class="org-src-container">
<pre class="src src-ixml">{ S: Formulas in general }
formula = basic-formula | compound-formula.
-compound-formula = 
        not 
      | and | or 
      | implies | iff
      .
</pre>
</div>
</div>
</div>

<div id="outline-container-org756d594" class="outline-3">
<h3 id="org756d594"><span class="section-number-3">3.6.</span> Recapitulation of language S</h3>
<div class="outline-text-3" id="text-3-6">
<p>
The grammar of language S can be summarized:
</p>
<div class="org-src-container">
<pre class="src src-ixml">ixml version "1.1".

{ s.ixml:  grammar for first-order logic
  (without identity or functions) }
s-formulas = os, formula++NL, os.
&lt;&lt;S-Formulas&gt;&gt;
&lt;&lt;XS-Compound-formulas&gt;&gt;
&lt;&lt;Quantification&gt;&gt;
&lt;&lt;S-Basic-formulas&gt;&gt;

&lt;&lt;Predicates&gt;&gt;
&lt;&lt;XS-Atomics&gt;&gt;
&lt;&lt;S-Atomics&gt;&gt;
&lt;&lt;Quoted-strings&gt;&gt;

&lt;&lt;Logical-operators&gt;&gt;
&lt;&lt;Quantifier-ops&gt;&gt;

&lt;&lt;Basics&gt;&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf63b67b" class="outline-3">
<h3 id="orgf63b67b"><span class="section-number-3">3.7.</span> Tests for language S</h3>
<div class="outline-text-3" id="text-3-7">
<p>
All tests for language XS can also serve as tests for language S.
So the tests below focus on the new parts of XS.
</p>

<p>
Let's show some simple predicates.
</p>
<div class="org-src-container">
<pre class="src src-data">/* Predicates */
P(x)
Q(x, y, z)
born('Frege', 1848)
born('Frege', ‹anno-1848›)
born(`Frege', ١٨٤٨)
p()
Φ(x) /\ Δ(υ, ζ)
</pre>
</div>

<p>
No whitespace before the parenthesis:
</p>
<div class="org-src-container">
<pre class="src src-data">P (x)
</pre>
</div>

<p>
Double-quoted constants denote propositions, not individuals.  So
<code>logician("Frege")</code> is not grammatical.
</p>
<div class="org-src-container">
<pre class="src src-data">logician("Frege")
</pre>
</div>

<p>
Single quoting is not required (and not allowed) for numerals:
</p>
<div class="org-src-container">
<pre class="src src-data">born('Frege', ‹1848›)
</pre>
</div>

<p>
Quantification is, of course, the main thing:
</p>
<div class="org-src-container">
<pre class="src src-data">(all p)(philosopher(p) implies (some d)(born(p, d)))
(∀ p)(philosopher(p) ⇒ (∃ d)(born(p, d)))
(forall n)(natural(n) implies (exists m)(next(n, m)))
(A n)(natural(n) implies (E m)(next(n, m)))
(~(ALL x)[P(x)]) → (EXISTS x)(~P(x))
</pre>
</div>

<p>
Summing it up:
</p>
<div class="org-src-container">
<pre class="src src-data">&lt;&lt;XS-Tests-predicates&gt;&gt;

&lt;&lt;XS-Tests-quantification&gt;&gt;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org8d45f17" class="outline-2">
<h2 id="org8d45f17"><span class="section-number-2">4.</span> Language M:  first-order logic with identity and functions</h2>
<div class="outline-text-2" id="text-4">
<p>
Vis-a-vis language S, language M adds:
</p>
<ul class="org-ul">
<li>identity and the symbol "<code>=</code>"</li>
<li>functions</li>
</ul>

<p>
Since the function syntax always uses parentheses, and functors are
always constants, language M extends the mechanisms for referring to
an individual: a specific individual can be referred to either by
using a constant like "<code>'f'</code>" or "<code>‹f›</code>" or by using a zero-argument
function expression like "<code>f()</code>".
</p>

<p>
[Full definition to be supplied.]
</p>
</div>
</div>

<div id="outline-container-orgf2e4ec6" class="outline-2">
<h2 id="orgf2e4ec6"><span class="section-number-2">5.</span> Language L:  additional convenience features</h2>
<div class="outline-text-2" id="text-5">
<p>
Language L adds a number of convenience features to language M:
</p>
<ul class="org-ul">
<li>typed quantifications (for all <i>x</i> of type <i>T</i>, &#x2026;; there is
some <i>x</i> of type <i>T</i> such that &#x2026;)</li>
<li>unique existential quantification (there exists exactly one
individual such that &#x2026;)</li>
<li>Skolem expressions (the unique individual who &#x2026;)</li>
<li>negated existential quantification (there is no <i>x</i> such that &#x2026;)</li>
<li><i>lone</i> existential quantification (there is at most one <i>x</i> such
that &#x2026;)</li>
</ul>

<p>
These are all intended as idioms for concise expression of commonly
used patterns; for each new construct, we specify a standard
translation into language M.
</p>

<p>
[Full definition to be supplied.]
</p>
</div>
</div>

<div id="outline-container-org4d7edb8" class="outline-2">
<h2 id="org4d7edb8"><span class="section-number-2">6.</span> Language XL: first-order logic plus set theory</h2>
<div class="outline-text-2" id="text-6">
<p>
Language XS adds sets <i>(and tuples? tbd)</i> to the universe of
discourse.  Concretely it adds:
</p>
<ul class="org-ul">
<li>the ability to declare variables as denoting sets of a given type</li>
<li>syntax for tuples</li>
<li>the ability to declare variables as denoting tuples in a given
relation (with symbols allowing the user to distinguish total
from partial functions, injections, and bijections)</li>
<li>symbols for standard set operations (membership, complementation,
union, intersection, subset relation, set difference)</li>
<li>set comprehensions</li>
</ul>

<p>
/(The inclusion of tuples, set comprehensions, and various forms of
functions and relations is uncertain.  Our initial instinct was to
exclude them for simplicity and reliability, since the ground has
proved so treacherous for so many.  But it may be that once sets are
added, we have tuples and relations whether we want them or not.  And
in that case, we might as well have set comprehensions to make them
easier to talk about.)/
</p>

<p>
[Full definition to be supplied.]
</p>
</div>
</div>

<div id="outline-container-org58d9e89" class="outline-2">
<h2 id="org58d9e89"><span class="section-number-2">7.</span> Concluding notes</h2>
<div class="outline-text-2" id="text-7">
<p>
The grammars defined here have two intended functions:
</p>
<ul class="org-ul">
<li>They provide specific targets for programs we write
which are to translate some notation or other into
'conventional first-order logic'.  That is, they allow
that vague description to be replaced by a statement
that the program's output is or should be sentences
in one of the languages defined here.</li>
<li>They make it easy to translate formulas into XML form
so they can be processed by XSLT or XQuery programs.  
We may write pretty-printers, normalizers, and (of course)
translations into specific target notations like ACL2
or TPTP FOF or TFF.</li>
</ul>
</div>

<div id="outline-container-org62112d1" class="outline-3">
<h3 id="org62112d1"><span class="section-number-3">7.1.</span> To do</h3>
<div class="outline-text-3" id="text-7-1">
<p>
Watch this space.
</p>

<ul class="org-ul">
<li>Create minimal test case exhibiting <i>vars</i> problem, report.</li>
</ul>
</div>
</div>
