W/W2024-05-fopc1234.org
** Questions to consider
At the time this paper was last revised (May 2024 or later), several
questions seemed to merit further consideration.  They are not
strictly speaking open questions, in so far as the grammars given here
provide specific answers to them.  But they are questions in whose
answers the authors do not currently feel completely confident.  Those
we remembered to write down are:

- Q. Should subscripts be allowed in identifiers?

  A. They already are.  The only effective way to allow subscripts is
  to provide some convenient typographic shorthand for them; the
  obvious choice is to separate the base name from the subscript with
  an underscore: thus /x/ with a subscribt of 1 can be written
  ~x\zwnj{}_1~, which can in HTML or on paper be formatted as /x_1/.
  But this is already allowed.

  Perhaps underscore should be allowed in identifiers /only/ with the
  meaning 'subscript'?  And thus only when followed by decimal digits?

  Tentative answer:  unnecessary.

- Q. Include an explicit notation for tuples in language XL?

- Q. Include explicit notation(s) for sequences in language XL?

- Q. Define variant grammars with less variation in the spelling of
  operators?

  Tentative answer: unnecessary.  Consistency of spelling is important
  for presentation, but not for ingestion of formulas.  A normalizer
  can easily be written to reserialize formula sequences in any
  desired form with consistent spelling (and optionally
  pretty-printing).

- Add /xor/ (aka /aut/), /nand/, /nor/?
  
- Eliminate propositional terms in S through XL / allow them only in
  XS?

- Allow marking variables with "~$~"?

- Allow other forms of numbers as individual constants? (Currently
  only unsigned integers are allowed.  And it's only the sentence
  about Frege being born in 1848 that motivates that.)

** Done
Temporary list of to-do items now completed.
- Split all operators into symbolic and alphabetic forms.
  Adjacent space is optional for symbolic form, required
  for alphabetics.  I think this works already for quantifiers,
  but the current grammar allows ~born('Frege', 1848)~ to be
  parsed either as intended or as equivalent to
  ~b ∨ n('Frege', 1848)~, which is going too far.
