W/W2024-05-fopc1234.html

<div id="outline-container-orga50b318" class="outline-3">
<h3 id="orga50b318"><span class="section-number-3">7.2.</span> Questions to consider</h3>
<div class="outline-text-3" id="text-7-2">
<p>
At the time this paper was last revised (May 2024 or later), several
questions seemed to merit further consideration.  They are not
strictly speaking open questions, in so far as the grammars given here
provide specific answers to them.  But they are questions in whose
answers the authors do not currently feel completely confident.  Those
we remembered to write down are:
</p>

<ul class="org-ul">
<li><p>
Q. Should subscripts be allowed in identifiers?
</p>

<p>
A. They already are.  The only effective way to allow subscripts is
to provide some convenient typographic shorthand for them; the
obvious choice is to separate the base name from the subscript with
an underscore: thus <i>x</i> with a subscribt of 1 can be written
<code>x\zwnj{}_1</code>, which can in HTML or on paper be formatted as <i>x<sub>1</sub></i>.
But this is already allowed.
</p>

<p>
Perhaps underscore should be allowed in identifiers <i>only</i> with the
meaning 'subscript'?  And thus only when followed by decimal digits?
</p>

<p>
Tentative answer:  unnecessary.
</p></li>

<li>Q. Include an explicit notation for tuples in language XL?</li>

<li>Q. Include explicit notation(s) for sequences in language XL?</li>

<li><p>
Q. Define variant grammars with less variation in the spelling of
operators?
</p>

<p>
Tentative answer: unnecessary.  Consistency of spelling is important
for presentation, but not for ingestion of formulas.  A normalizer
can easily be written to reserialize formula sequences in any
desired form with consistent spelling (and optionally
pretty-printing).
</p></li>

<li>Add <i>xor</i> (aka <i>aut</i>), <i>nand</i>, <i>nor</i>?</li>

<li>Eliminate propositional terms in S through XL / allow them only in
XS?</li>

<li>Allow marking variables with "<code>$</code>"?</li>

<li>Allow other forms of numbers as individual constants? (Currently
only unsigned integers are allowed.  And it's only the sentence
about Frege being born in 1848 that motivates that.)</li>
</ul>
</div>
</div>

<div id="outline-container-orgbd05d0c" class="outline-3">
<h3 id="orgbd05d0c"><span class="section-number-3">7.3.</span> Done</h3>
<div class="outline-text-3" id="text-7-3">
<p>
Temporary list of to-do items now completed.
</p>
<ul class="org-ul">
<li>Split all operators into symbolic and alphabetic forms.
Adjacent space is optional for symbolic form, required
for alphabetics.  I think this works already for quantifiers,
but the current grammar allows <code>born('Frege', 1848)</code> to be
parsed either as intended or as equivalent to
<code>b ∨ n('Frege', 1848)</code>, which is going too far.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 16 May 2024</p>
<p class="author">Author: CMSMcQ and CH</p>
<p class="date">Created: 2024-05-23 Thu 16:49</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
